{
  "backend/main.mo": "Defines an empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Lists features, affected files, components, and test IDs confirming removal of music and photos and updates to asset docs.",
  "frontend-file-summaries.txt": "Provides brief descriptions of all frontend Valentine app files and their roles after removing music and photo features.",
  "frontend/ASSETS.md": "Explains that the app no longer uses photos or music and offers guidance for customizing messages, colors, and animations.",
  "frontend/index.css": "Tailwind base and theme variables defining Valentine color palette and dark-mode variants.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component managing page navigation, loading overlay, and ambient layer.",
  "frontend/src/features/valentine/components/AmbientLayer.tsx": "Renders ambient animation container and bouncing teddy using useAmbientAnimations.",
  "frontend/src/features/valentine/components/EvasiveNoButton.tsx": "A button that jumps to random screen positions when clicked.",
  "frontend/src/features/valentine/components/LoadingOverlay.tsx": "Full-screen loading overlay with pulsing heart and fade-out animation.",
  "frontend/src/features/valentine/components/MusicControls.tsx": "Empty placeholder file; music UI removed.",
  "frontend/src/features/valentine/components/RoundedImage.tsx": "Empty placeholder file; image component removed.",
  "frontend/src/features/valentine/components/ValentineButton.tsx": "Styled wrapper around shadcn Button using Valentine theme classes.",
  "frontend/src/features/valentine/components/ValentineLayout.tsx": "Layout wrapper with themed background, card container, and footer attribution.",
  "frontend/src/features/valentine/components/YesCelebrationDialog.tsx": "Dialog showing celebratory message and emojis when the user selects Yes.",
  "frontend/src/features/valentine/hooks/useAmbientAnimations.ts": "Hook spawning and cleaning up falling hearts, sparkles, roses, kisses, and cursor hearts.",
  "frontend/src/features/valentine/hooks/useBackgroundMusic.ts": "Empty placeholder file; background music logic removed.",
  "frontend/src/features/valentine/ValentinePages.tsx": "Implements five sequential Valentine-themed pages with text, buttons, and a final Yes/No interaction.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom Valentine-themed color variables and animations.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider, rendering the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and utilities, including Valentine-specific color mappings.",
  "project_state.json": "Describes project configuration, feature requirements, and architectural notes for the Valentine-themed web experience."
}