{
  "kind": "build_request",
  "title": "Remove all photo rendering and background music from the Valentine experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Remove all background music functionality from the Valentine app so no audio file is loaded or played and no music UI is shown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remove photos and music from it"
        ]
      },
      "acceptanceCriteria": [
        "No audio element is created and no call to play background music occurs on app load.",
        "The music control UI is not rendered anywhere in the app (including any 'Play Music' prompt).",
        "The app has no runtime console errors related to missing audio assets."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Remove all photo rendering from the Valentine pages so no image assets are referenced or displayed on any of the five pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remove photos and music from it"
        ]
      },
      "acceptanceCriteria": [
        "Pages 2–5 do not render any photo/image components and do not reference /assets/images/photo1.jpg, photo2.jpg, photo3.jpg, or yourphoto.jpg.",
        "The app has no runtime console errors related to missing image assets.",
        "Page layouts remain visually balanced after image removal (no broken spacing or empty placeholder blocks)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the developer-facing asset documentation to reflect that photos and background music are no longer required by the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Remove photos and music from it"
        ]
      },
      "acceptanceCriteria": [
        "frontend/ASSETS.md no longer states that images/audio are required and does not instruct placing photo*.jpg or the mp3 under frontend/public/assets.",
        "Documentation is consistent with the current UI behavior (no photos/music)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend remains a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not remove or change the existing ambient Valentine animations (hearts/sparkles/roses/kisses/teddy), page navigation, loading overlay, or the Page 5 Yes/No interaction behavior, except as needed to remove photos/music references."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}